kanuba0814/NanoSoul/sdkconfig.defaults
# NanoSoul test 分支默认配置 — 最简屏控硬件自检（全本地，无相机/网络/上位机）。
# 目标由 idf.py set-target esp32p4 写入 sdkconfig。
CONFIG_IDF_TARGET="esp32p4"

# Flash 16MB（开发板板载）
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# 自定义分区（单 app，无 OTA）
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 日志
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# 体积优化 (-Os)
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# 主任务栈（点屏 + 起任务）
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# —— PSRAM：MIPI-DSI 帧缓存 + LVGL 绘制缓冲在 PSRAM（开发板实测可用）——
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# esp_lcd MIPI-DSI 需要
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# —— 相机 (esp_video MIPI-CSI, OV5647): 与 test-host 全整机同版 ——
# CSI ISR 走 cache-safe, 避免偶发 0x102 崩溃
CONFIG_CAM_CTLR_MIPI_CSI_ISR_CACHE_SAFE=y
# OV5647 传感器驱动 (不开则 esp_video 无驱动 -> /dev/video0 不注册 -> open 失败)
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_AUTO_DETECT=y
CONFIG_CAMERA_OV5647_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_OV5647_MIPI_RAW8_800x1280_50FPS=y

# —— LVGL ——
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_BUILTIN_MALLOC=y
CONFIG_LV_MEM_SIZE_KILOBYTES=128
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
